%线性规划
lb = [0,0,0,0,0,0,0,0,0,0];
rb = [1000,500,600,1000,1200,1600,1800,800,600,900];%最大箱数
f = [-4200,-5400,-5000,-4300,-4200,-4500,-4800,-5100,-4600,-4800];%每类利润
right =0.01 * [96000;96000;96000;96000];
left = avg;
intcon=[1 2 3 4 5 6 7 8 9 10];
[x,fval]=intlinprog(f,intcon,left,right,[],[],lb,rb);

%模拟退火
sol_66 = [1:66];
[best_solution,best_fit,iter,pkq,l_s] = mySa5(sol_66,0.99,120,1,10000,avg_5);

%求解参数
batch_num = ceil(96000/best_fit);
XXX = batch_num * x;%每类产量
F = (-1) * f;
F_sum = F * XXX; %总利润
avgno = [2,2,2,2,2,3,3,3,3,3,3,5,5,5,5,5,5,5,5,5,5,5,5,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,7,7,7,7,7,7,8,8,8,8,8,8,8,8,9,9,9,9,9,9,10,10,10,10,10,10,10,10];
for i = 1:66
    seq(i) = avgno(best_solution(i));
end
